name: "ner"
platform: "pytorch_libtorch"
max_batch_size: 8
input [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [ -1 ]
  },
  {
    name: "slice"
    data_type: TYPE_INT64
    dims: [ -1 ]
  }
]

output [
  {
    name: "502"
    data_type: TYPE_FP32
    dims: [ -1, 13 ]  # last dimension is num labels
  }
]

instance_group [
  { kind: KIND_CPU}
]